{"config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 64, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block1_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 64, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block1_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block1_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 128, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block2_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 128, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block2_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block2_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 256, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block3_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 256, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block3_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 256, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block3_conv3", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block3_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block4_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block4_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block4_conv3", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block4_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block5_conv1", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block5_conv2", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "block5_conv3", "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D", "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block5_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "units": 1024, "activation": "relu", "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "units": 200, "activation": "softmax", "name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}]}, "keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow"}